STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253cxx_cm33.h
typedef struct
{
  __IO uint32_t CR;               /*!< OCTOSPI Control register,                           Address offset: 0x000 */
       uint32_t RESERVED;         /*!< Reserved,                                           Address offset: 0x004 */
  __IO uint32_t DCR1;             /*!< OCTOSPI Device Configuration register 1,            Address offset: 0x008 */
  __IO uint32_t DCR2;             /*!< OCTOSPI Device Configuration register 2,            Address offset: 0x00C */
  __IO uint32_t DCR3;             /*!< OCTOSPI Device Configuration register 3,            Address offset: 0x010 */
  __IO uint32_t DCR4;             /*!< OCTOSPI Device Configuration register 4,            Address offset: 0x014 */
       uint32_t RESERVED1[2];     /*!< Reserved,                                           Address offset: 0x018-0x01C */
  __IO uint32_t SR;               /*!< OCTOSPI Status register,                            Address offset: 0x020 */
  __IO uint32_t FCR;              /*!< OCTOSPI Flag Clear register,                        Address offset: 0x024 */
       uint32_t RESERVED2[6];     /*!< Reserved,                                           Address offset: 0x028-0x03C */
  __IO uint32_t DLR;              /*!< OCTOSPI Data Length register,                       Address offset: 0x040 */
       uint32_t RESERVED3;        /*!< Reserved,                                           Address offset: 0x044 */
  __IO uint32_t AR;               /*!< OCTOSPI Address register,                           Address offset: 0x048 */
       uint32_t RESERVED4;        /*!< Reserved,                                           Address offset: 0x04C */
  __IO uint32_t DR;               /*!< OCTOPSI Data register,                              Address offset: 0x050 */
       uint32_t RESERVED5[11];    /*!< Reserved,                                           Address offset: 0x054-0x07C */
  __IO uint32_t PSMKR;            /*!< OCTOSPI Polling Status Mask register,               Address offset: 0x080 */
       uint32_t RESERVED6;        /*!< Reserved,                                           Address offset: 0x084 */
  __IO uint32_t PSMAR;            /*!< OCTOSPI Polling Status Match register,              Address offset: 0x088 */
       uint32_t RESERVED7;        /*!< Reserved,                                           Address offset: 0x08C */
  __IO uint32_t PIR;              /*!< OCTOSPI Polling Interval register,                  Address offset: 0x090 */
       uint32_t RESERVED8[27];    /*!< Reserved,                                           Address offset: 0x094-0x0FC */
  __IO uint32_t CCR;              /*!< OCTOSPI Communication Configuration register,       Address offset: 0x100 */
       uint32_t RESERVED9;        /*!< Reserved,                                           Address offset: 0x104 */
  __IO uint32_t TCR;              /*!< OCTOSPI Timing Configuration register,              Address offset: 0x108 */
       uint32_t RESERVED10;       /*!< Reserved,                                           Address offset: 0x10C */
  __IO uint32_t IR;               /*!< OCTOSPI Instruction register,                       Address offset: 0x110 */
       uint32_t RESERVED11[3];    /*!< Reserved,                                           Address offset: 0x114-0x11C */
  __IO uint32_t ABR;              /*!< OCTOSPI Alternate Bytes register,                   Address offset: 0x120 */
       uint32_t RESERVED12[3];    /*!< Reserved,                                           Address offset: 0x124-0x12C */
  __IO uint32_t LPTR;             /*!< OCTOSPI Low Power Timeout register,                 Address offset: 0x130 */
       uint32_t RESERVED13[3];    /*!< Reserved,                                           Address offset: 0x134-0x13C */
  __IO uint32_t WPCCR;            /*!< OCTOSPI Wrap Communication Configuration register,  Address offset: 0x140 */
       uint32_t RESERVED14;       /*!< Reserved,                                           Address offset: 0x144 */
  __IO uint32_t WPTCR;            /*!< OCTOSPI Wrap Timing Configuration register,         Address offset: 0x148 */
       uint32_t RESERVED15;       /*!< Reserved,                                           Address offset: 0x14C */
  __IO uint32_t WPIR;             /*!< OCTOSPI Wrap Instruction register,                  Address offset: 0x150 */
       uint32_t RESERVED16[3];    /*!< Reserved,                                           Address offset: 0x154-0x15C */
  __IO uint32_t WPABR;            /*!< OCTOSPI Wrap Alternate Bytes register,              Address offset: 0x160 */
       uint32_t RESERVED17[7];    /*!< Reserved,                                           Address offset: 0x164-0x17C */
  __IO uint32_t WCCR;             /*!< OCTOSPI Write Communication Configuration register, Address offset: 0x180 */
       uint32_t RESERVED18;       /*!< Reserved,                                           Address offset: 0x184 */
  __IO uint32_t WTCR;             /*!< OCTOSPI Write Timing Configuration register,        Address offset: 0x188 */
       uint32_t RESERVED19;       /*!< Reserved,                                           Address offset: 0x18C */
  __IO uint32_t WIR;              /*!< OCTOSPI Write Instruction register,                 Address offset: 0x190 */
       uint32_t RESERVED20[3];    /*!< Reserved,                                           Address offset: 0x194-0x19C */
  __IO uint32_t WABR;             /*!< OCTOSPI Write Alternate Bytes register,             Address offset: 0x1A0 */
       uint32_t RESERVED21[23];   /*!< Reserved,                                           Address offset: 0x1A4-0x1FC */
  __IO uint32_t HLCR;             /*!< OCTOSPI Hyperbus Latency Configuration register,    Address offset: 0x200 */
       uint32_t RESERVED22[122];  /*!< Reserved,                                           Address offset: 0x204-0x3E8 */
  __IO uint32_t HWCFGR2;          /*!< OCTOSPI hardware configuration register 2           Address offset: 0x3EC */
  __IO uint32_t HWCFGR;           /*!< OCTOSPI HW Configuration register,                  Address offset: 0x3F0 */
  __IO uint32_t VERR;             /*!< OCTOSPI Version register,                           Address offset: 0x3F4 */
  __IO uint32_t IDR;              /*!< OCTOSPI Identification register,                    Address offset: 0x3F8 */
  __IO uint32_t MIDR;             /*!< OCTOPSI HW Magic ID register,                       Address offset: 0x3FC */
} OCTOSPI_TypeDef;

/**
  * @brief OCTO Serial Peripheral Interface IO Manager
  */

typedef struct
{
  __IO uint32_t CR;               /*!< OCTOSPI IO Manager Control register,                 Address offset: 0x00 */
  uint32_t RESERVED0[251];        /*!< Reserved                                             Address offset: 0x004-0x3EC */
  __IO uint32_t HWCFGR;           /*!< OCTOSPI IO Manager hardware configuration register   Address offset: 0x3F0 */
  __IO uint32_t VERR;             /*!< OCTOSPI IO Manager version register                  Address offset: 0x3F4 */
  __IO uint32_t IDR;              /*!< OCTOSPI IO Manager identification                    Address offset: 0x3F8 */
  __IO uint32_t SIDR;             /*!< OCTOSPI IO Manager size identification register      Address offset: 0x3FC */
} OCTOSPIM_TypeDef;

/**
  * @brief OTFDEC register
  */
typedef struct
{
  __IO uint32_t REG_CONFIGR;      /*!< OTFDEC Region Configuration register,          Address offset: 0x20 + 0x30 * (x -1) (x = 1 to 4) */
  __IO uint32_t REG_START_ADDR;   /*!< OTFDEC Region Start Address register,          Address offset: 0x24 + 0x30 * (x -1) (x = 1 to 4) */
  __IO uint32_t REG_END_ADDR;     /*!< OTFDEC Region End Address register,            Address offset: 0x28 + 0x30 * (x -1) (x = 1 to 4) */
  __IO uint32_t REG_NONCER0;      /*!< OTFDEC Region Nonce register 0,                Address offset: 0x2C + 0x30 * (x -1) (x = 1 to 4) */
  __IO uint32_t REG_NONCER1;      /*!< OTFDEC Region Nonce register 1,                Address offset: 0x30 + 0x30 * (x -1) (x = 1 to 4) */
  __IO uint32_t REG_KEYR0;        /*!< OTFDEC Region Key register 0,                  Address offset: 0x34 + 0x30 * (x -1) (x = 1 to 4) */
  __IO uint32_t REG_KEYR1;        /*!< OTFDEC Region Key register 1,                  Address offset: 0x38 + 0x30 * (x -1) (x = 1 to 4) */
  __IO uint32_t REG_KEYR2;        /*!< OTFDEC Region Key register 2,                  Address offset: 0x3C + 0x30 * (x -1) (x = 1 to 4) */
  __IO uint32_t REG_KEYR3;        /*!< OTFDEC Region Key register 3,                  Address offset: 0x40 + 0x30 * (x -1) (x = 1 to 4) */
} OTFDEC_Region_TypeDef;

typedef struct
{
  __IO uint32_t CR;               /*!< OTFDEC Control register,                                 Address offset: 0x000 */
  uint32_t RESERVED1[4];          /*!< Reserved,                                                Address offset: 0x004-0x010 */
  uint32_t RESERVED2[187];        /*!< Reserved,                                                Address offset: 0x014-0x2FC */
  __IO uint32_t ISR;              /*!< OTFDEC Interrupt Status register,                        Address offset: 0x300 */
  __IO uint32_t ICR;              /*!< OTFDEC Interrupt Clear register,                         Address offset: 0x304 */
  __IO uint32_t IER;              /*!< OTFDEC Interrupt Enable register,                        Address offset: 0x308 */
  uint32_t RESERVED3[57];         /*!< Reserved,                                                Address offset: 0x30C-0x3EC */
  __IO uint32_t HWCFGR;           /*!< OTFDEC hardware configuration register                   Address offset: 0x3F0 */
  __IO uint32_t VERR;             /*!< OTFDEC version register                                  Address offset: 0x3F4 */
  __IO uint32_t IPIDR;            /*!< OTFDEC identification register                           Address offset: 0x3F8 */
  __IO uint32_t SIDR;             /*!< OTFDEC size ID register                                  Address offset: 0x3FC */
} OTFDEC_TypeDef;

/**
  * @brief Public Key Accelerator (PKA)
  */
#define PKA_RAM_SIZE (5336U/4U)
typedef struct
{
  __IO uint32_t CR;             /*!< PKA control register,                Address offset: 0x0000 */
  __IO uint32_t SR;             /*!< PKA status register,                 Address offset: 0x0004 */
  __IO uint32_t CLRFR;          /*!< PKA clear flag register,             Address offset: 0x0008 */
       uint32_t Reserved1[253];                /*!< Reserved,                    Address offset: 0x000C-0x03FC */
  __IO uint32_t RAM[PKA_RAM_SIZE];             /*!< PKA RAM,                    Address offset: 0x0400-0xXXXX */
       uint32_t Reserved2[1788-PKA_RAM_SIZE];  /*!< Reserved                    Address offset: (0xXXXX+4)-0x1FEF */
  __IO uint32_t HWCFGR;         /*!< PKA hardware configuration register, Address offset: 0x1FF0 */
  __IO uint32_t VERR;           /*!< PKA version register,                Address offset: 0x1FF4 */
  __IO uint32_t IPIDR;          /*!< PKA identification register,         Address offset: 0x1FF8 */
  __IO uint32_t SIDR;           /*!< PKA size ID register,                Address offset: 0x1FFC */
} PKA_TypeDef;

/**
  * @brief PSSI
  */

typedef struct
{
  __IO uint32_t CR;             /*!< PSSI control register 1,               Address offset: 0x000 */
  __IO uint32_t SR;             /*!< PSSI status register,                  Address offset: 0x004 */
  __IO uint32_t RIS;            /*!< PSSI raw interrupt status register,    Address offset: 0x008 */
  __IO uint32_t IER;            /*!< PSSI interrupt enable register,        Address offset: 0x00C */
  __IO uint32_t MIS;            /*!< PSSI masked interrupt status register, Address offset: 0x010 */
  __IO uint32_t ICR;            /*!< PSSI interrupt clear register,         Address offset: 0x014 */
  __IO uint32_t RESERVED1[4];   /*!< Reserved,                                      0x018 - 0x024 */
  __IO uint32_t DR;             /*!< PSSI data register,                    Address offset: 0x028 */
  __IO uint32_t RESERVED2[241]; /*!< Reserved,                                      0x02C - 0x3EC */
  __IO uint32_t HWCFGR;         /*!< PSSI IP HW configuration register,     Address offset: 0x3F0 */
  __IO uint32_t VERR;           /*!< PSSI IP version register,              Address offset: 0x3F4 */
  __IO uint32_t IPIDR;          /*!< PSSI IP ID register,                   Address offset: 0x3F8 */
  __IO uint32_t SIDR;           /*!< PSSI SIZE ID register,                 Address offset: 0x3FC */
} PSSI_TypeDef;

/**
  * @brief Power Management
  */
typedef struct
{
  __IO uint32_t CR1;             /*!< PWR control register 1                         Address offset: 0x000 */
  __IO uint32_t CR2;             /*!< PWR control register 2                         Address offset: 0x004 */
  __IO uint32_t CR3;             /*!< PWR control register 3                         Address offset: 0x008 */
       uint32_t RESERVED0;       /*!< Reserved                                       Address offset: 0x00C */
  __IO uint32_t CR5;             /*!< PWR control register 5                         Address offset: 0x010 */
  __IO uint32_t CR6;             /*!< PWR control register 6                         Address offset: 0x014 */
  __IO uint32_t CR7;             /*!< PWR control register 7                         Address offset: 0x018 */
  __IO uint32_t CR8;             /*!< PWR control register 8                         Address offset: 0x01C */
  __IO uint32_t CR9;             /*!< PWR control register 9                         Address offset: 0x020 */
  __IO uint32_t CR10;            /*!< PWR control register 10                        Address offset: 0x024 */
  __IO uint32_t CR11;            /*!< PWR control register 11                        Address offset: 0x028 */
  __IO uint32_t CR12;            /*!< PWR control register 12                        Address offset: 0x02C */
       uint32_t RESERVED1[2];    /*!< Reserved                                       Address offset: 0x030-0x034 */
  __IO uint32_t BDCR1;           /*!< PWR backup domain control register 1           Address offset: 0x038 */
  __IO uint32_t BDCR2;           /*!< PWR backup domain control register 2           Address offset: 0x03C */
  __IO uint32_t CPU1CR;          /*!< PWR CPU1 control register                      Address offset: 0x040 */
  __IO uint32_t CPU2CR;          /*!< PWR CPU2 control register                      Address offset: 0x044 */
  __IO uint32_t CPU3CR;          /*!< PWR CPU3 control register                      Address offset: 0x048 */
  __IO uint32_t D1CR;            /*!< PWR D1 control register                        Address offset: 0x04C */
  __IO uint32_t D2CR;            /*!< PWR D2 control register                        Address offset: 0x050 */
  __IO uint32_t D3CR;            /*!< PWR D3 control register                        Address offset: 0x054 */
       uint32_t RESERVED2[2];    /*!< Reserved                                       Address offset: 0x058-0x05C */
  __IO uint32_t WKUPCR1;         /*!< PWR wake-up control register 1                 Address offset: 0x060 */
  __IO uint32_t WKUPCR2;         /*!< PWR wake-up control register 2                 Address offset: 0x064 */
  __IO uint32_t WKUPCR3;         /*!< PWR wake-up control register 3                 Address offset: 0x068 */
  __IO uint32_t WKUPCR4;         /*!< PWR wake-up control register 4                 Address offset: 0x06C */
  __IO uint32_t WKUPCR5;         /*!< PWR wake-up control register 5                 Address offset: 0x070 */
  __IO uint32_t WKUPCR6;         /*!< PWR wake-up control register 6                 Address offset: 0x074 */
       uint32_t RESERVED3[8];    /*!< Reserved                                       Address offset: 0x078-0x094 */
  __IO uint32_t D3WKUPENR;       /*!< PWR D3 wake-up enable register                 Address offset: 0x098 */
       uint32_t RESERVED4[25];   /*!< Reserved                                       Address offset: 0x09C-0x0FC */
  __IO uint32_t RSECCFGR;        /*!< PWR resource secure configuration register     Address offset: 0x100 */
  __IO uint32_t RPRIVCFGR;       /*!< PWR resource privileged configuration register Address offset: 0x104 */
  __IO uint32_t RxCIDCFGR[7];    /*!< PWR Resource 0-6 CID Configuration Registers   Address offsets 0x108-0x120 */
       uint32_t RESERVED5[23];   /*!< Reserved                                       Address offset: 0x124-0x17C */
  __IO uint32_t WIOSECCFGR;      /*!< PWR WIO secure configuration register          Address offset: 0x180 */
  __IO uint32_t WIOPRIVCFGR;     /*!< PWR WIO privileged configuration register      Address offset: 0x184 */
  __IO uint32_t WIO1CIDCFGR;     /*!< PWR WIO 1 CID configuration register           Address offset: 0x188 */
  __IO uint32_t WIO1SEMCR;       /*!< PWR WIO 1 semaphore control register           Address offset: 0x18C */
  __IO uint32_t WIO2CIDCFGR;     /*!< PWR WIO 2 CID configuration register           Address offset: 0x190 */
  __IO uint32_t WIO2SEMCR;       /*!< PWR WIO 2 semaphore control register           Address offset: 0x194 */
  __IO uint32_t WIO3CIDCFGR;     /*!< PWR WIO 3 CID configuration register           Address offset: 0x198 */
  __IO uint32_t WIO3SEMCR;       /*!< PWR WIO 3 semaphore control register           Address offset: 0x19C */
  __IO uint32_t WIO4CIDCFGR;     /*!< PWR WIO 4 CID configuration register           Address offset: 0x1A0 */
  __IO uint32_t WIO4SEMCR;       /*!< PWR WIO 4 semaphore control register           Address offset: 0x1A4 */
  __IO uint32_t WIO5CIDCFGR;     /*!< PWR WIO 5 CID configuration register           Address offset: 0x1A8 */
  __IO uint32_t WIO5SEMCR;       /*!< PWR WIO 5 semaphore control register           Address offset: 0x1AC */
  __IO uint32_t WIO6CIDCFGR;     /*!< PWR WIO 6 CID configuration register           Address offset: 0x1B0 */
  __IO uint32_t WIO6SEMCR;       /*!< PWR WIO 6 semaphore control register           Address offset: 0x1B4 */
       uint32_t RESERVED6[18];   /*!< Reserved                                       Address offset: 0x1B8-0x1FC */
  __IO uint32_t CPU1D1SR;        /*!< PWR CPU1 status register                       Address offset: 0x200 */
  __IO uint32_t CPU2D2SR;        /*!< PWR CPU2 status register                       Address offset: 0x204 */
  __IO uint32_t CPU3D3SR;        /*!< PWR CPU3 status register                       Address offset: 0x208 */
       uint32_t RESERVED7[122];  /*!< Reserved                                       Address offset: 0x20C-0x3F0 */
  __IO uint32_t VERR;            /*!< PWR VER register                               Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< PWR identifier register                        Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< PWR size identification register               Address offset: 0x3FC */
} PWR_TypeDef;

/**
  * @brief SRAMs configuration controller
  */
typedef struct
{
  __IO uint32_t CR;           /*!< Control Register,                  Address offset: 0x000 */
  __IO uint32_t IER;          /*!< Interrupt Enable Register,         Address offset: 0x004 */
  __IO uint32_t ISR;          /*!< Interrupt Status Register,         Address offset: 0x008 */
  __IO uint32_t SEAR;         /*!< ECC Single Error Address Register, Address offset: 0x00C */
  __IO uint32_t DEAR;         /*!< ECC Double Error Address Register, Address offset: 0x010 */
  __IO uint32_t ICR;          /*!< Interrupt Clear Register,          Address offset: 0x014 */
       uint32_t RESERVED1[3]; /*!< Reserved1,                         Address offset: 0x018-0x20 */
  __IO uint32_t ECCKEY;       /*!< ECC Key Register,                  Address offset: 0x024 */
  __IO uint32_t ERKEYR;       /*!< Erase Key Register,                Address offset: 0x028 */
       uint32_t RESERVED2;    /*!< Reserved2,                         Address offset: 0x02C */
  __IO uint32_t CCR1;         /*!< CRC Control Register 1,            Address offset: 0x030 */
  __IO uint32_t CCR2;         /*!< CRC Control Register 2,            Address offset: 0x034 */
  __IO uint32_t CRSR;         /*!< CRC Reference Signature Register,  Address offset: 0x038 */
  __IO uint32_t CSR;          /*!< CRC Status Register,               Address offset: 0x03C */
  __IO uint32_t CCSR;         /*!< CRC Calculated Signature Register, Address offset: 0x040 */
} RAMCFG_TypeDef;

/**
  * @brief Resets & Clocks Control
  *        reference document : Chapter #22 "Reset and clock control (RCC)"
  *                             RM0457 - Reference Manual - STM32MP25xx
  *                             advanced ARM-based 32/64-bit MPUs
  *                             file "DM00485804 (RM0457) Rev0.1.pdf"
  *                             (Revision 0.1 / 09-Mar-2021)
  */

typedef struct
{
  __IO uint32_t CIDCFGR; /*!< RCC Resource x CID Configuration Register */
  __IO uint32_t SEMCR;   /*!< RCC Resource x Semaphore Control Register */
} RCC_Comp_TypeDef;

