STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253cxx_cm33.h
/******************  Bit definition for BSEC_SIDR register  *******************/
#define BSEC_SIDR_SID_Pos             (0U)
#define BSEC_SIDR_SID_Msk             (0xFFFFFFFFUL << BSEC_SIDR_SID_Pos)      /*!< 0xFFFFFFFF */
#define BSEC_SIDR_SID                 BSEC_SIDR_SID_Msk                       /*!< BSEC size identification */

/******************************************************************************/
/*                                                                            */
/*                                (CA35 SYSCFG)                               */
/*                                                                            */
/******************************************************************************/
/***********  Bit definition for CA35SYSCFG_ETR_LPI_CR register  ***********/
#define CA35SYSCFG_ETR_LPI_CR_ETR_CSYSREQ_Pos                    (0U)
#define CA35SYSCFG_ETR_LPI_CR_ETR_CSYSREQ_Msk                    (0x1UL << CA35SYSCFG_ETR_LPI_CR_ETR_CSYSREQ_Pos)       /*!< 0x00000001 */
#define CA35SYSCFG_ETR_LPI_CR_ETR_CSYSREQ                        CA35SYSCFG_ETR_LPI_CR_ETR_CSYSREQ_Msk                 /*!<  */

/***********  Bit definition for CA35SYSCFG_ETR_LPI_SR register  ***********/
#define CA35SYSCFG_ETR_LPI_SR_ETR_CSYSACK_Pos                    (0U)
#define CA35SYSCFG_ETR_LPI_SR_ETR_CSYSACK_Msk                    (0x1UL << CA35SYSCFG_ETR_LPI_SR_ETR_CSYSACK_Pos)       /*!< 0x00000001 */
#define CA35SYSCFG_ETR_LPI_SR_ETR_CSYSACK                        CA35SYSCFG_ETR_LPI_SR_ETR_CSYSACK_Msk                 /*!<  */

/********  Bit definition for CA35SYSCFG_STM_NSGUAREN_CR register  *********/
#define CA35SYSCFG_STM_NSGUAREN_CR_STM_NSGUAREN_Pos              (0U)
#define CA35SYSCFG_STM_NSGUAREN_CR_STM_NSGUAREN_Msk              (0x1UL << CA35SYSCFG_STM_NSGUAREN_CR_STM_NSGUAREN_Pos) /*!< 0x00000001 */
#define CA35SYSCFG_STM_NSGUAREN_CR_STM_NSGUAREN                  CA35SYSCFG_STM_NSGUAREN_CR_STM_NSGUAREN_Msk           /*!<  */

/********  Bit definition for CA35SYSCFG_TRACE_CLK_DIV_CR register  ********/
#define CA35SYSCFG_TRACE_CLK_DIV_CR_TRACE_CLK_DIV_VALUE_Pos      (0U)
#define CA35SYSCFG_TRACE_CLK_DIV_CR_TRACE_CLK_DIV_VALUE_Msk      (0x3FUL << CA35SYSCFG_TRACE_CLK_DIV_CR_TRACE_CLK_DIV_VALUE_Pos)        /*!< 0x0000003F */
#define CA35SYSCFG_TRACE_CLK_DIV_CR_TRACE_CLK_DIV_VALUE          CA35SYSCFG_TRACE_CLK_DIV_CR_TRACE_CLK_DIV_VALUE_Msk   /*!< 0x1 to 0x3F: Divider ratio from 2 to 64 */

/***********  Bit definition for CA35SYSCFG_DBGPWR_CR register  ************/
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP0_Pos                       (0U)
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP0_Msk                       (0x1UL << CA35SYSCFG_DBGPWR_CR_DBGPWRUP0_Pos)          /*!< 0x00000001 */
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP0                           CA35SYSCFG_DBGPWR_CR_DBGPWRUP0_Msk                    /*!<  */
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP1_Pos                       (1U)
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP1_Msk                       (0x1UL << CA35SYSCFG_DBGPWR_CR_DBGPWRUP1_Pos)          /*!< 0x00000002 */
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP1                           CA35SYSCFG_DBGPWR_CR_DBGPWRUP1_Msk                    /*!<  */

/*******  Bit definition for CA35SYSCFG_DBGL1RSTDISABLE_CR register  *******/
#define CA35SYSCFG_DBGL1RSTDISABLE_CR_DBGL1RSTDIS_Pos            (0U)
#define CA35SYSCFG_DBGL1RSTDISABLE_CR_DBGL1RSTDIS_Msk            (0x1UL << CA35SYSCFG_DBGL1RSTDISABLE_CR_DBGL1RSTDIS_Pos) /*!< 0x00000001 */
#define CA35SYSCFG_DBGL1RSTDISABLE_CR_DBGL1RSTDIS                CA35SYSCFG_DBGL1RSTDISABLE_CR_DBGL1RSTDIS_Msk         /*!<  */

/***********  Bit definition for CA35SYSCFG_DBGPWR_SR register  ************/
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN0_Pos                    (0U)
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN0_Msk                    (0x1UL << CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN0_Pos)       /*!< 0x00000001 */
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN0                        CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN0_Msk                 /*!<  */
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN1_Pos                    (1U)
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN1_Msk                    (0x1UL << CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN1_Pos)       /*!< 0x00000002 */
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN1                        CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN1_Msk                 /*!<  */
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ0_Pos                    (2U)
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ0_Msk                    (0x1UL << CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ0_Pos)       /*!< 0x00000004 */
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ0                        CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ0_Msk                 /*!<  */
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ1_Pos                    (3U)
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ1_Msk                    (0x1UL << CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ1_Pos)       /*!< 0x00000008 */
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ1                        CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ1_Msk                 /*!<  */

/***********  Bit definition for CA35SYSCFG_EDBGACK_SR register  ***********/
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C0_Pos                      (0U)
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C0_Msk                      (0x1UL << CA35SYSCFG_EDBGACK_SR_DBGACK_C0_Pos)         /*!< 0x00000001 */
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C0                          CA35SYSCFG_EDBGACK_SR_DBGACK_C0_Msk                   /*!<  */
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C1_Pos                      (1U)
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C1_Msk                      (0x1UL << CA35SYSCFG_EDBGACK_SR_DBGACK_C1_Pos)         /*!< 0x00000002 */
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C1                          CA35SYSCFG_EDBGACK_SR_DBGACK_C1_Msk                   /*!<  */

/*********  Bit definition for CA35SYSCFG_AARCH_MODE_CR register  **********/
#define CA35SYSCFG_AARCH_MODE_CR_AA64NAA32_Pos                   (0U)
#define CA35SYSCFG_AARCH_MODE_CR_AA64NAA32_Msk                   (0x1UL << CA35SYSCFG_AARCH_MODE_CR_AA64NAA32_Pos)      /*!< 0x00000001 */
#define CA35SYSCFG_AARCH_MODE_CR_AA64NAA32                       CA35SYSCFG_AARCH_MODE_CR_AA64NAA32_Msk                /*!<  */

/************  Bit definition for CA35SYSCFG_VBAR_CR register  *************/
#define CA35SYSCFG_VBAR_CR_RVBARADDRL_Pos                        (2U)
#define CA35SYSCFG_VBAR_CR_RVBARADDRL_Msk                        (0x3FFFFFFFUL << CA35SYSCFG_VBAR_CR_RVBARADDRL_Pos)    /*!< 0xFFFFFFFC */
#define CA35SYSCFG_VBAR_CR_RVBARADDRL                            CA35SYSCFG_VBAR_CR_RVBARADDRL_Msk                     /*!< Set the value of reset vector at the boundaries of the Cortex-A35 cores */

/*********  Bit definition for CA35SYSCFG_M33_ACCESS_CR register  **********/
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_SEC_Pos                  (0U)
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_SEC_Msk                  (0x1UL << CA35SYSCFG_M33_ACCESS_CR_M33CFG_SEC_Pos)     /*!< 0x00000001 */
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_SEC                      CA35SYSCFG_M33_ACCESS_CR_M33CFG_SEC_Msk               /*!<  */
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_PRIV_Pos                 (1U)
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_PRIV_Msk                 (0x1UL << CA35SYSCFG_M33_ACCESS_CR_M33CFG_PRIV_Pos)    /*!< 0x00000002 */
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_PRIV                     CA35SYSCFG_M33_ACCESS_CR_M33CFG_PRIV_Msk              /*!<  */

/**********  Bit definition for CA35SYSCFG_M33_TZEN_CR register  ***********/
#define CA35SYSCFG_M33_TZEN_CR_CFG_SECEXT_Pos                    (0U)
#define CA35SYSCFG_M33_TZEN_CR_CFG_SECEXT_Msk                    (0x1UL << CA35SYSCFG_M33_TZEN_CR_CFG_SECEXT_Pos)       /*!< 0x00000001 */
#define CA35SYSCFG_M33_TZEN_CR_CFG_SECEXT                        CA35SYSCFG_M33_TZEN_CR_CFG_SECEXT_Msk                 /*!<  */

/********  Bit definition for CA35SYSCFG_M33_INITSVTOR_CR register  ********/
#define CA35SYSCFG_M33_INITSVTOR_CR_INITSVTOR_Pos                (7U)
#define CA35SYSCFG_M33_INITSVTOR_CR_INITSVTOR_Msk                (0x1FFFFFFUL << CA35SYSCFG_M33_INITSVTOR_CR_INITSVTOR_Pos)   /*!< 0xFFFFFF80 */
#define CA35SYSCFG_M33_INITSVTOR_CR_INITSVTOR                    CA35SYSCFG_M33_INITSVTOR_CR_INITSVTOR_Msk             /*!< Secure vector table offset */

/*******  Bit definition for CA35SYSCFG_M33_INITNSVTOR_CR register  ********/
#define CA35SYSCFG_M33_INITNSVTOR_CR_INITNSVTOR_Pos              (7U)
#define CA35SYSCFG_M33_INITNSVTOR_CR_INITNSVTOR_Msk              (0x1FFFFFFUL << CA35SYSCFG_M33_INITNSVTOR_CR_INITNSVTOR_Pos)     /*!< 0xFFFFFF80 */
#define CA35SYSCFG_M33_INITNSVTOR_CR_INITNSVTOR                  CA35SYSCFG_M33_INITNSVTOR_CR_INITNSVTOR_Msk           /*!< Non-secure vector table offset */

/*************  Bit definition for CA35SYSCFG_VERR register  ***************/
#define CA35SYSCFG_VERR_MINREV_Pos                               (0U)
#define CA35SYSCFG_VERR_MINREV_Msk                               (0xFUL << CA35SYSCFG_VERR_MINREV_Pos)                  /*!< 0x0000000F */
#define CA35SYSCFG_VERR_MINREV                                   CA35SYSCFG_VERR_MINREV_Msk                            /*!< minor revision information */
#define CA35SYSCFG_VERR_MAJREV_Pos                               (4U)
#define CA35SYSCFG_VERR_MAJREV_Msk                               (0xFUL << CA35SYSCFG_VERR_MAJREV_Pos)                  /*!< 0x000000F0 */
#define CA35SYSCFG_VERR_MAJREV                                    CA35SYSCFG_VERR_MAJREV_Msk                           /*!< major revision information */

/*************  Bit definition for CA35SYSCFG_IPIDR register  **************/
#define CA35SYSCFG_IPIDR_ID_Pos                                  (0U)
#define CA35SYSCFG_IPIDR_ID_Msk                                  (0xFFFFFFFFUL << CA35SYSCFG_IPIDR_ID_Pos)              /*!< 0xFFFFFFFF */
#define CA35SYSCFG_IPIDR_ID                                      CA35SYSCFG_IPIDR_ID_Msk                               /*!< BSEC identification */

/*************  Bit definition for CA35SYSCFG_SIDR register  ***************/
#define CA35SYSCFG_SIDR_SID_Pos                                  (0U)
#define CA35SYSCFG_SIDR_SID_Msk                                  (0xFFFFFFFFUL << CA35SYSCFG_SIDR_SID_Pos)              /*!< 0xFFFFFFFF */
#define CA35SYSCFG_SIDR_SID                                      CA35SYSCFG_SIDR_SID_Msk                               /*!< BSEC size identification */

/******************************************************************************/
/*                                                                            */
/*                          CRC calculation unit                              */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for CRC_DR register  *********************/
#define CRC_DR_DR_Pos            (0U)
#define CRC_DR_DR_Msk            (0xFFFFFFFFUL << CRC_DR_DR_Pos)                /*!< 0xFFFFFFFF */
#define CRC_DR_DR                CRC_DR_DR_Msk                                 /*!< Data register bits */

/*******************  Bit definition for CRC_IDR register  ********************/
#define CRC_IDR_IDR_Pos          (0U)
#define CRC_IDR_IDR_Msk          (0xFFFFFFFFUL << CRC_IDR_IDR_Pos)              /*!< 0xFFFFFFFF */
#define CRC_IDR_IDR              CRC_IDR_IDR_Msk                               /*!< General-purpose 32-bit data register bits */

/********************  Bit definition for CRC_CR register  ********************/
#define CRC_CR_RESET_Pos         (0U)
#define CRC_CR_RESET_Msk         (0x1UL << CRC_CR_RESET_Pos)                    /*!< 0x00000001 */
#define CRC_CR_RESET             CRC_CR_RESET_Msk                              /*!< RESET the CRC computation unit bit */
#define CRC_CR_POLYSIZE_Pos      (3U)
#define CRC_CR_POLYSIZE_Msk      (0x3UL << CRC_CR_POLYSIZE_Pos)                 /*!< 0x00000018 */
#define CRC_CR_POLYSIZE          CRC_CR_POLYSIZE_Msk                           /*!< Polynomial size bits */
#define CRC_CR_POLYSIZE_0        (0x1UL << CRC_CR_POLYSIZE_Pos)                 /*!< 0x00000008 */
#define CRC_CR_POLYSIZE_1        (0x2UL << CRC_CR_POLYSIZE_Pos)                 /*!< 0x00000010 */
#define CRC_CR_REV_IN_Pos        (5U)
#define CRC_CR_REV_IN_Msk        (0x3UL << CRC_CR_REV_IN_Pos)                   /*!< 0x00000060 */
#define CRC_CR_REV_IN            CRC_CR_REV_IN_Msk                             /*!< REV_IN Reverse Input Data bits */
#define CRC_CR_REV_IN_0          (0x1UL << CRC_CR_REV_IN_Pos)                   /*!< 0x00000020 */
#define CRC_CR_REV_IN_1          (0x2UL << CRC_CR_REV_IN_Pos)                   /*!< 0x00000040 */
#define CRC_CR_REV_OUT_Pos       (7U)
#define CRC_CR_REV_OUT_Msk       (0x1UL << CRC_CR_REV_OUT_Pos)                  /*!< 0x00000080 */
#define CRC_CR_REV_OUT           CRC_CR_REV_OUT_Msk                            /*!< REV_OUT Reverse Output Data bits */

/*******************  Bit definition for CRC_INIT register  *******************/
#define CRC_INIT_INIT_Pos        (0U)
#define CRC_INIT_INIT_Msk        (0xFFFFFFFFUL << CRC_INIT_INIT_Pos)            /*!< 0xFFFFFFFF */
#define CRC_INIT_INIT            CRC_INIT_INIT_Msk                             /*!< Initial CRC value bits */

/*******************  Bit definition for CRC_POL register  ********************/
#define CRC_POL_POL_Pos          (0U)
#define CRC_POL_POL_Msk          (0xFFFFFFFFUL << CRC_POL_POL_Pos)              /*!< 0xFFFFFFFF */
#define CRC_POL_POL              CRC_POL_POL_Msk                               /*!< Coefficients of the polynomial */

/******************************************************************************/
/*                                                                            */
/*                            Crypto Processor                                */
/*                                                                            */
/******************************************************************************/
/******************* Bits definition for CRYP_CR register  ********************/
#define CRYP_CR_ALGODIR_Pos              (2U)
#define CRYP_CR_ALGODIR_Msk              (0x1UL << CRYP_CR_ALGODIR_Pos)         /*!< 0x00000004 */
#define CRYP_CR_ALGODIR                  CRYP_CR_ALGODIR_Msk
#define CRYP_CR_ALGOMODE_Pos             (3U)
#define CRYP_CR_ALGOMODE_Msk             (0x10007UL << CRYP_CR_ALGOMODE_Pos)    /*!< 0x00080038 */
#define CRYP_CR_ALGOMODE                 CRYP_CR_ALGOMODE_Msk
#define CRYP_CR_ALGOMODE_0               (0x00001UL << CRYP_CR_ALGOMODE_Pos)    /*!< 0x00000008 */
#define CRYP_CR_ALGOMODE_1               (0x00002UL << CRYP_CR_ALGOMODE_Pos)    /*!< 0x00000010 */
#define CRYP_CR_ALGOMODE_2               (0x00004UL << CRYP_CR_ALGOMODE_Pos)    /*!< 0x00000020 */
#define CRYP_CR_DATATYPE_Pos             (6U)
#define CRYP_CR_DATATYPE_Msk             (0x3UL << CRYP_CR_DATATYPE_Pos)        /*!< 0x000000C0 */
#define CRYP_CR_DATATYPE                 CRYP_CR_DATATYPE_Msk
#define CRYP_CR_DATATYPE_0               (0x1UL << CRYP_CR_DATATYPE_Pos)        /*!< 0x00000040 */
#define CRYP_CR_DATATYPE_1               (0x2UL << CRYP_CR_DATATYPE_Pos)        /*!< 0x00000080 */
#define CRYP_CR_KEYSIZE_Pos              (8U)
#define CRYP_CR_KEYSIZE_Msk              (0x3UL << CRYP_CR_KEYSIZE_Pos)         /*!< 0x00000300 */
#define CRYP_CR_KEYSIZE                  CRYP_CR_KEYSIZE_Msk
#define CRYP_CR_KEYSIZE_0                (0x1UL << CRYP_CR_KEYSIZE_Pos)         /*!< 0x00000100 */
#define CRYP_CR_KEYSIZE_1                (0x2UL << CRYP_CR_KEYSIZE_Pos)         /*!< 0x00000200 */
#define CRYP_CR_FFLUSH_Pos               (14U)
#define CRYP_CR_FFLUSH_Msk               (0x1UL << CRYP_CR_FFLUSH_Pos)          /*!< 0x00004000 */
#define CRYP_CR_FFLUSH                   CRYP_CR_FFLUSH_Msk
#define CRYP_CR_CRYPEN_Pos               (15U)
#define CRYP_CR_CRYPEN_Msk               (0x1UL << CRYP_CR_CRYPEN_Pos)          /*!< 0x00008000 */
#define CRYP_CR_CRYPEN                   CRYP_CR_CRYPEN_Msk
#define CRYP_CR_GCM_CCMPH_Pos            (16U)
#define CRYP_CR_GCM_CCMPH_Msk            (0x3UL << CRYP_CR_GCM_CCMPH_Pos)       /*!< 0x00030000 */
#define CRYP_CR_GCM_CCMPH                CRYP_CR_GCM_CCMPH_Msk
#define CRYP_CR_GCM_CCMPH_0              (0x1UL << CRYP_CR_GCM_CCMPH_Pos)       /*!< 0x00010000 */
#define CRYP_CR_GCM_CCMPH_1              (0x2UL << CRYP_CR_GCM_CCMPH_Pos)       /*!< 0x00020000 */
#define CRYP_CR_ALGOMODE_3_Pos           (19U)
#define CRYP_CR_ALGOMODE_3_Msk           (0x1UL << CRYP_CR_ALGOMODE_3_Pos)          /*!< 0x00080000 */
#define CRYP_CR_ALGOMODE_3               CRYP_CR_ALGOMODE_3_Msk                    /*!< ALGOMODE[3] */
#define CRYP_CR_NPBLB_Pos                (20U)
#define CRYP_CR_NPBLB_Msk                (0xFUL << CRYP_CR_NPBLB_Pos)           /*!< 0x00F00000 */
#define CRYP_CR_NPBLB                    CRYP_CR_NPBLB_Msk
#define CRYP_CR_KMOD_Pos                 (24U)
#define CRYP_CR_KMOD_Msk                 (0x3UL << CRYP_CR_KMOD_Pos)            /*!< 0x03000000 */
#define CRYP_CR_KMOD                     CRYP_CR_KMOD_Msk
#define CRYP_CR_KMOD_2                   (0x02UL << CRYP_CR_KMOD_Pos)
#define CRYP_CR_IPRST_Pos                (31U)
#define CRYP_CR_IPRST_Msk                (0x1UL << CRYP_CR_IPRST_Pos)           /*!< 0x80000000 */
#define CRYP_CR_IPRST                    CRYP_CR_IPRST_Msk

/****************** Bits definition for CRYP_SR register  *********************/
#define CRYP_SR_IFEM_Pos                 (0U)
#define CRYP_SR_IFEM_Msk                 (0x1UL << CRYP_SR_IFEM_Pos)            /*!< 0x00000001 */
#define CRYP_SR_IFEM                     CRYP_SR_IFEM_Msk
#define CRYP_SR_IFNF_Pos                 (1U)
#define CRYP_SR_IFNF_Msk                 (0x1UL << CRYP_SR_IFNF_Pos)            /*!< 0x00000002 */
#define CRYP_SR_IFNF                     CRYP_SR_IFNF_Msk
#define CRYP_SR_OFNE_Pos                 (2U)
#define CRYP_SR_OFNE_Msk                 (0x1UL << CRYP_SR_OFNE_Pos)            /*!< 0x00000004 */
#define CRYP_SR_OFNE                     CRYP_SR_OFNE_Msk
#define CRYP_SR_OFFU_Pos                 (3U)
#define CRYP_SR_OFFU_Msk                 (0x1UL << CRYP_SR_OFFU_Pos)            /*!< 0x00000008 */
#define CRYP_SR_OFFU                     CRYP_SR_OFFU_Msk
#define CRYP_SR_BUSY_Pos                 (4U)
#define CRYP_SR_BUSY_Msk                 (0x1UL << CRYP_SR_BUSY_Pos)            /*!< 0x00000010 */
#define CRYP_SR_BUSY                     CRYP_SR_BUSY_Msk
#define CRYP_SR_KERF_Pos                 (6U)
#define CRYP_SR_KERF_Msk                 (0x1UL << CRYP_SR_KERF_Pos)            /*!< 0x00000040 */
#define CRYP_SR_KERF                     CRYP_SR_KERF_Msk
#define CRYP_SR_KEYVALID_Pos             (7U)
#define CRYP_SR_KEYVALID_Msk             (0x1UL << CRYP_SR_KEYVALID_Pos)        /*!< 0x00000080 */
#define CRYP_SR_KEYVALID                 CRYP_SR_KEYVALID_Msk

