STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253cxx_cm33.h
/******************  Bit definition for CSI_HVERR register  *******************/
#define CSI_HVERR_MINREV_Pos            (0U)
#define CSI_HVERR_MINREV_Msk            (0xFUL << CSI_HVERR_MINREV_Pos)           /*!< 0x0000000F */
#define CSI_HVERR_MINREV                CSI_HVERR_MINREV_Msk                     /*!< Major revision */
#define CSI_HVERR_MAJREV_Pos            (4U)
#define CSI_HVERR_MAJREV_Msk            (0xFUL << CSI_HVERR_MAJREV_Pos)           /*!< 0x000000F0 */
#define CSI_HVERR_MAJREV                CSI_HVERR_MAJREV_Msk                     /*!< Major revision */

/******************  Bit definition for CSI_HIPIDR register  ******************/
#define CSI_HIPIDR_ID_Pos               (0U)
#define CSI_HIPIDR_ID_Msk               (0xFFFFFFFFUL << CSI_HIPIDR_ID_Pos)       /*!< 0xFFFFFFFF */
#define CSI_HIPIDR_ID                   CSI_HIPIDR_ID_Msk                        /*!< Identification code */

/******************  Bit definition for CSI_HSIDR register  *******************/
#define CSI_HSIDR_SID_Pos               (0U)
#define CSI_HSIDR_SID_Msk               (0xFFFFFFFFUL << CSI_HSIDR_SID_Pos)       /*!< 0xFFFFFFFF */
#define CSI_HSIDR_SID                   CSI_HSIDR_SID_Msk                        /*!< Size and ID */

/*******************  Bit definition for CSI_PRCR register  *******************/
#define CSI_PRCR_PEN_Pos                (1U)
#define CSI_PRCR_PEN_Msk                (0x1UL << CSI_PRCR_PEN_Pos)               /*!< 0x00000002 */
#define CSI_PRCR_PEN                    CSI_PRCR_PEN_Msk                         /*!< When set to 0, this bit places the digital section of the D-PHY in the reset state */

/*******************  Bit definition for CSI_PMCR register  *******************/
#define CSI_PMCR_FRXMDL0_Pos            (0U)
#define CSI_PMCR_FRXMDL0_Msk            (0x1UL << CSI_PMCR_FRXMDL0_Pos)           /*!< 0x00000001 */
#define CSI_PMCR_FRXMDL0                CSI_PMCR_FRXMDL0_Msk                     /*!< Force to Rx Mode the Data Lane 0 */
#define CSI_PMCR_FRXMDL1_Pos            (1U)
#define CSI_PMCR_FRXMDL1_Msk            (0x1UL << CSI_PMCR_FRXMDL1_Pos)           /*!< 0x00000002 */
#define CSI_PMCR_FRXMDL1                CSI_PMCR_FRXMDL1_Msk                     /*!< Force to Rx Mode the Data Lane 1 */
#define CSI_PMCR_FTXSMDL0_Pos           (2U)
#define CSI_PMCR_FTXSMDL0_Msk           (0x1UL << CSI_PMCR_FTXSMDL0_Pos)          /*!< 0x00000004 */
#define CSI_PMCR_FTXSMDL0               CSI_PMCR_FTXSMDL0_Msk                    /*!< Force to Tx Stop Mode the Data Lane 0 */
#define CSI_PMCR_DTDL_Pos               (4U)
#define CSI_PMCR_DTDL_Msk               (0x1UL << CSI_PMCR_DTDL_Pos)              /*!< 0x00000010 */
#define CSI_PMCR_DTDL                   CSI_PMCR_DTDL_Msk                        /*!< Disable Turn-around Data Lane 0 */
#define CSI_PMCR_RTDL0_Pos              (8U)
#define CSI_PMCR_RTDL0_Msk              (0x1UL << CSI_PMCR_RTDL0_Pos)             /*!< 0x00000100 */
#define CSI_PMCR_RTDL0                  CSI_PMCR_RTDL0_Msk                       /*!< Turn-around Request Data Lane 0 */
#define CSI_PMCR_TUESDL0_Pos            (12U)
#define CSI_PMCR_TUESDL0_Msk            (0x1UL << CSI_PMCR_TUESDL0_Pos)           /*!< 0x00001000 */
#define CSI_PMCR_TUESDL0                CSI_PMCR_TUESDL0_Msk                     /*!< Tx ULP Escape-mode Data Lane 0 */
#define CSI_PMCR_TUEXDL0_Pos            (16U)
#define CSI_PMCR_TUEXDL0_Msk            (0x1UL << CSI_PMCR_TUEXDL0_Pos)           /*!< 0x00010000 */
#define CSI_PMCR_TUEXDL0                CSI_PMCR_TUEXDL0_Msk                     /*!< Tx ULP Exit-sequence Data Lane 0 */

/*******************  Bit definition for CSI_PFCR register  *******************/
#define CSI_PFCR_CCFR_Pos               (0U)
#define CSI_PFCR_CCFR_Msk               (0x3FUL << CSI_PFCR_CCFR_Pos)             /*!< 0x0000003F */
#define CSI_PFCR_CCFR                   CSI_PFCR_CCFR_Msk                        /*!< Configuration Clock Frequency Range selection */
#define CSI_PFCR_HSFR_Pos               (8U)
#define CSI_PFCR_HSFR_Msk               (0x7FUL << CSI_PFCR_HSFR_Pos)             /*!< 0x00007F00 */
#define CSI_PFCR_HSFR                   CSI_PFCR_HSFR_Msk                        /*!< PHY-high-speed Frequency Range selection */
#define CSI_PFCR_DLD_Pos                (16U)
#define CSI_PFCR_DLD_Msk                (0x1UL << CSI_PFCR_DLD_Pos)               /*!< 0x00010000 */
#define CSI_PFCR_DLD                    CSI_PFCR_DLD_Msk                         /*!< Data Lane Direction of lane0 */

/******************  Bit definition for CSI_PTCR0 register  *******************/
#define CSI_PTCR0_TCKEN_Pos             (0U)
#define CSI_PTCR0_TCKEN_Msk             (0x1UL << CSI_PTCR0_TCKEN_Pos)            /*!< 0x00000001 */
#define CSI_PTCR0_TCKEN                 CSI_PTCR0_TCKEN_Msk                      /*!< Test-interface Clock Enable for the TDI bus into the PHY */
#define CSI_PTCR0_TRSEN_Pos             (1U)
#define CSI_PTCR0_TRSEN_Msk             (0x1UL << CSI_PTCR0_TRSEN_Pos)            /*!< 0x00000002 */
#define CSI_PTCR0_TRSEN                 CSI_PTCR0_TRSEN_Msk                      /*!< Test-interface Reset Enable for the TDI bus into the PHY */

/******************  Bit definition for CSI_PTCR1 register  *******************/
#define CSI_PTCR1_TDI_Pos               (0U)
#define CSI_PTCR1_TDI_Msk               (0xFFUL << CSI_PTCR1_TDI_Pos)             /*!< 0x000000FF */
#define CSI_PTCR1_TDI                   CSI_PTCR1_TDI_Msk                        /*!< Test-interface Data In */
#define CSI_PTCR1_TWM_Pos               (16U)
#define CSI_PTCR1_TWM_Msk               (0x1UL << CSI_PTCR1_TWM_Pos)              /*!< 0x00010000 */
#define CSI_PTCR1_TWM                   CSI_PTCR1_TWM_Msk                        /*!< Test-interface Write Mode selector */

/*******************  Bit definition for CSI_PTSR register  *******************/
#define CSI_PTSR_TDO_Pos                (0U)
#define CSI_PTSR_TDO_Msk                (0xFFUL << CSI_PTSR_TDO_Pos)              /*!< 0x000000FF */
#define CSI_PTSR_TDO                    CSI_PTSR_TDO_Msk                         /*!< CSI PHY test interface data output bus for read-back and internal probing functionalities */

/******************  Bit definition for CSI_HWCFGR register  ******************/
#define CSI_HWCFGR_TECHNO_Pos           (0U)
#define CSI_HWCFGR_TECHNO_Msk           (0xFUL << CSI_HWCFGR_TECHNO_Pos)          /*!< 0x0000000F */
#define CSI_HWCFGR_TECHNO               CSI_HWCFGR_TECHNO_Msk                    /*!< Technology */
#define CSI_HWCFGR_LANES_Pos            (4U)
#define CSI_HWCFGR_LANES_Msk            (0xFUL << CSI_HWCFGR_LANES_Pos)           /*!< 0x000000F0 */
#define CSI_HWCFGR_LANES                CSI_HWCFGR_LANES_Msk                     /*!< amount of CSI DataLanes (excluding the ClockLane thus) */

/*******************  Bit definition for CSI_VERR register  *******************/
#define CSI_VERR_MINREV_Pos             (0U)
#define CSI_VERR_MINREV_Msk             (0xFUL << CSI_VERR_MINREV_Pos)            /*!< 0x0000000F */
#define CSI_VERR_MINREV                 CSI_VERR_MINREV_Msk                      /*!< Major revision */
#define CSI_VERR_MAJREV_Pos             (4U)
#define CSI_VERR_MAJREV_Msk             (0xFUL << CSI_VERR_MAJREV_Pos)            /*!< 0x000000F0 */
#define CSI_VERR_MAJREV                 CSI_VERR_MAJREV_Msk                      /*!< Major revision */

/******************  Bit definition for CSI_IPIDR register  *******************/
#define CSI_IPIDR_ID_Pos                (0U)
#define CSI_IPIDR_ID_Msk                (0xFFFFFFFFUL << CSI_IPIDR_ID_Pos)        /*!< 0xFFFFFFFF */
#define CSI_IPIDR_ID                    CSI_IPIDR_ID_Msk                         /*!< Identification code */

