STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253cxx_cm33.h
/******************************* WWDG Instances *******************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE) (((INSTANCE) == WWDG1_S) || ((INSTANCE) == WWDG1_NS) || \
                                        ((INSTANCE) == WWDG2_S) || ((INSTANCE) == WWDG2_NS))

#else /* CORTEX_IN_SECURE_STATE */
/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == ADC1) ||                   \
                                       ((INSTANCE) == ADC2)  ||                   \
                                       ((INSTANCE) == ADC3))

#define IS_ADC_MULTIMODE_MASTER_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)

#define IS_ADC_COMMON_INSTANCE(INSTANCE) (((INSTANCE) == ADC12_COMMON) ||         \
                                          ((INSTANCE) == ADC3_COMMON))

/******************************** BSEC Instances **********************************/
#define IS_BSEC_ALL_INSTANCE(INSTANCE)       ((INSTANCE) == BSEC)

/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == CRC))

/******************************* DCACHE Instances ********************************/
#define IS_DCACHE_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DCACHE)

/******************************* CSI Instances *******************************/
#define IS_CSI_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CSI)

/******************************* DCMI Instances *******************************/
#define IS_DCMI_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DCMI)

/******************************* DCMIPP Instances *******************************/
#define IS_DCMIPP_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DCMIPP)

/******************************** DMA Instances *******************************/
#define IS_DMA_ALL_INSTANCE(INSTANCE) (((INSTANCE) == HPDMA1_Channel0)  || \
                                       ((INSTANCE) == HPDMA1_Channel1)  || \
                                       ((INSTANCE) == HPDMA1_Channel2)  || \
                                       ((INSTANCE) == HPDMA1_Channel3)  || \
                                       ((INSTANCE) == HPDMA1_Channel4)  || \
                                       ((INSTANCE) == HPDMA1_Channel5)  || \
                                       ((INSTANCE) == HPDMA1_Channel6)  || \
                                       ((INSTANCE) == HPDMA1_Channel7)  || \
                                       ((INSTANCE) == HPDMA1_Channel8)  || \
                                       ((INSTANCE) == HPDMA1_Channel9)  || \
                                       ((INSTANCE) == HPDMA1_Channel10) || \
                                       ((INSTANCE) == HPDMA1_Channel11) || \
                                       ((INSTANCE) == HPDMA1_Channel12) || \
                                       ((INSTANCE) == HPDMA1_Channel13) || \
                                       ((INSTANCE) == HPDMA1_Channel14) || \
                                       ((INSTANCE) == HPDMA1_Channel15) || \
                                       ((INSTANCE) == HPDMA2_Channel0)  || \
                                       ((INSTANCE) == HPDMA2_Channel1)  || \
                                       ((INSTANCE) == HPDMA2_Channel2)  || \
                                       ((INSTANCE) == HPDMA2_Channel3)  || \
                                       ((INSTANCE) == HPDMA2_Channel4)  || \
                                       ((INSTANCE) == HPDMA2_Channel5)  || \
                                       ((INSTANCE) == HPDMA2_Channel6)  || \
                                       ((INSTANCE) == HPDMA2_Channel7)  || \
                                       ((INSTANCE) == HPDMA2_Channel8)  || \
                                       ((INSTANCE) == HPDMA2_Channel9)  || \
                                       ((INSTANCE) == HPDMA2_Channel10) || \
                                       ((INSTANCE) == HPDMA2_Channel11) || \
                                       ((INSTANCE) == HPDMA2_Channel12) || \
                                       ((INSTANCE) == HPDMA2_Channel13) || \
                                       ((INSTANCE) == HPDMA2_Channel14) || \
                                       ((INSTANCE) == HPDMA2_Channel15) || \
                                       ((INSTANCE) == HPDMA3_Channel0)  || \
                                       ((INSTANCE) == HPDMA3_Channel1)  || \
                                       ((INSTANCE) == HPDMA3_Channel2)  || \
                                       ((INSTANCE) == HPDMA3_Channel3)  || \
                                       ((INSTANCE) == HPDMA3_Channel4)  || \
                                       ((INSTANCE) == HPDMA3_Channel5)  || \
                                       ((INSTANCE) == HPDMA3_Channel6)  || \
                                       ((INSTANCE) == HPDMA3_Channel7)  || \
                                       ((INSTANCE) == HPDMA3_Channel8)  || \
                                       ((INSTANCE) == HPDMA3_Channel9)  || \
                                       ((INSTANCE) == HPDMA3_Channel10) || \
                                       ((INSTANCE) == HPDMA3_Channel11) || \
                                       ((INSTANCE) == HPDMA3_Channel12) || \
                                       ((INSTANCE) == HPDMA3_Channel13) || \
                                       ((INSTANCE) == HPDMA3_Channel14) || \
                                       ((INSTANCE) == HPDMA3_Channel15) || \
                                       ((INSTANCE) == LPDMA_Channel0)   || \
                                       ((INSTANCE) == LPDMA_Channel1)   || \
                                       ((INSTANCE) == LPDMA_Channel2)   || \
                                       ((INSTANCE) == LPDMA_Channel3))

#define IS_HPDMA_INSTANCE(INSTANCE) (((INSTANCE) == HPDMA1_Channel0)  || \
                                     ((INSTANCE) == HPDMA1_Channel1)  || \
                                     ((INSTANCE) == HPDMA1_Channel2)  || \
                                     ((INSTANCE) == HPDMA1_Channel3)  || \
                                     ((INSTANCE) == HPDMA1_Channel4)  || \
                                     ((INSTANCE) == HPDMA1_Channel5)  || \
                                     ((INSTANCE) == HPDMA1_Channel6)  || \
                                     ((INSTANCE) == HPDMA1_Channel7)  || \
                                     ((INSTANCE) == HPDMA1_Channel8)  || \
                                     ((INSTANCE) == HPDMA1_Channel9)  || \
                                     ((INSTANCE) == HPDMA1_Channel10) || \
                                     ((INSTANCE) == HPDMA1_Channel11) || \
                                     ((INSTANCE) == HPDMA1_Channel12) || \
                                     ((INSTANCE) == HPDMA1_Channel13) || \
                                     ((INSTANCE) == HPDMA1_Channel14) || \
                                     ((INSTANCE) == HPDMA1_Channel15) || \
                                     ((INSTANCE) == HPDMA2_Channel0)  || \
                                     ((INSTANCE) == HPDMA2_Channel1)  || \
                                     ((INSTANCE) == HPDMA2_Channel2)  || \
                                     ((INSTANCE) == HPDMA2_Channel3)  || \
                                     ((INSTANCE) == HPDMA2_Channel4)  || \
                                     ((INSTANCE) == HPDMA2_Channel5)  || \
                                     ((INSTANCE) == HPDMA2_Channel6)  || \
                                     ((INSTANCE) == HPDMA2_Channel7)  || \
                                     ((INSTANCE) == HPDMA2_Channel8)  || \
                                     ((INSTANCE) == HPDMA2_Channel9)  || \
                                     ((INSTANCE) == HPDMA2_Channel10) || \
                                     ((INSTANCE) == HPDMA2_Channel11) || \
                                     ((INSTANCE) == HPDMA2_Channel12) || \
                                     ((INSTANCE) == HPDMA2_Channel13) || \
                                     ((INSTANCE) == HPDMA2_Channel14) || \
                                     ((INSTANCE) == HPDMA2_Channel15) || \
                                     ((INSTANCE) == HPDMA3_Channel0)  || \
                                     ((INSTANCE) == HPDMA3_Channel1)  || \
                                     ((INSTANCE) == HPDMA3_Channel2)  || \
                                     ((INSTANCE) == HPDMA3_Channel3)  || \
                                     ((INSTANCE) == HPDMA3_Channel4)  || \
                                     ((INSTANCE) == HPDMA3_Channel5)  || \
                                     ((INSTANCE) == HPDMA3_Channel6)  || \
                                     ((INSTANCE) == HPDMA3_Channel7)  || \
                                     ((INSTANCE) == HPDMA3_Channel8)  || \
                                     ((INSTANCE) == HPDMA3_Channel9)  || \
                                     ((INSTANCE) == HPDMA3_Channel10) || \
                                     ((INSTANCE) == HPDMA3_Channel11) || \
                                     ((INSTANCE) == HPDMA3_Channel12) || \
                                     ((INSTANCE) == HPDMA3_Channel13) || \
                                     ((INSTANCE) == HPDMA3_Channel14) || \
                                     ((INSTANCE) == HPDMA3_Channel15))

#define IS_LPDMA_INSTANCE(INSTANCE) (((INSTANCE) == LPDMA_Channel0)   || \
                                     ((INSTANCE) == LPDMA_Channel1)   || \
                                     ((INSTANCE) == LPDMA_Channel2)   || \
                                     ((INSTANCE) == LPDMA_Channel3))

#define IS_DMA_2D_ADDRESSING_INSTANCE(INSTANCE) (((INSTANCE) == HPDMA1_Channel12)  || \
                                                 ((INSTANCE) == HPDMA1_Channel13)  || \
                                                 ((INSTANCE) == HPDMA1_Channel14)  || \
                                                 ((INSTANCE) == HPDMA1_Channel15)  || \
                                                 ((INSTANCE) == HPDMA2_Channel12)  || \
                                                 ((INSTANCE) == HPDMA2_Channel13)  || \
                                                 ((INSTANCE) == HPDMA2_Channel14)  || \
                                                 ((INSTANCE) == HPDMA2_Channel15)  || \
                                                 ((INSTANCE) == HPDMA3_Channel12)  || \
                                                 ((INSTANCE) == HPDMA3_Channel13)  || \
                                                 ((INSTANCE) == HPDMA3_Channel14)  || \
                                                 ((INSTANCE) == HPDMA3_Channel15))
#define IS_DMA_PFREQ_INSTANCE(INSTANCE) (((INSTANCE) == HPDMA1_Channel12)  || \
                                         ((INSTANCE) == HPDMA1_Channel13)  || \
                                         ((INSTANCE) == HPDMA1_Channel14)  || \
                                         ((INSTANCE) == HPDMA1_Channel15)  || \
                                         ((INSTANCE) == HPDMA2_Channel12)  || \
                                         ((INSTANCE) == HPDMA2_Channel13)  || \
                                         ((INSTANCE) == HPDMA2_Channel14)  || \
                                         ((INSTANCE) == HPDMA2_Channel15)  || \
                                         ((INSTANCE) == HPDMA3_Channel12)  || \
                                         ((INSTANCE) == HPDMA3_Channel13)  || \
                                         ((INSTANCE) == HPDMA3_Channel14)  || \
                                         ((INSTANCE) == HPDMA3_Channel15)  || \
                                         ((INSTANCE) == LPDMA_Channel0)    || \
                                         ((INSTANCE) == LPDMA_Channel1)    || \
                                         ((INSTANCE) == LPDMA_Channel2)    || \
                                         ((INSTANCE) == LPDMA_Channel3))

/******************************** EXTI Instances **********************************/
#define IS_EXTI_ALL_INSTANCE(INSTANCE)  ( ((INSTANCE) == EXTI1) || ((INSTANCE) == EXTI2))

